"""Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)"""

#Вариант 1

n = int(input("Введите число: "))
sum=0
while n>0:
    x=n%10
    sum=sum+x
    n=n//10
    
print(sum)

#ИЛИ Вариант2

x = input("ВВедите число: ")
sum1 = int(x[0]) + int(x[1]) + int(x[2])
print(sum1)